{"Top": "20101203153200", "Filename": "2010-12-03_1532_US_CampaignAds_Service_Employees_International_Union"}
{"Collection": "Communication Studies Archive, UCLA"}
{"UID": "e140fff2-0cf5-11e2-9731-3f334b9f7ff9"}
{"Acquired_Time": "2012-10-03 0101 UTC"}
{"Duration": "0:00:49.71"}
{"Video_Picture_Size": "480x360", "Original_Picture_Size": ""}
{"Program_Title": "Lory Parks: Times are tough in Detroit"}
{"URL": "http://youtube.com/watch?v=WiTPcFchmZw"}
{"Transcript": "Youtube English machine transcript 2012-10-03 0101 UTC"}
{"Comment": ""}
{"Headlines": "Times are tough in my hometown of Detroit. And for my family. I've worked as a Certified Nursing Assistant for 22 years and always paid my bills on time. But banks started foreclosing on homes in Detroit. My home's value fell as banks let foreclosed homes decay. Then my payments skyrocketed as banks dodged their fair share of taxes. <br />I began falling behind on my mortgage payments. As each month passed, I began cutting back however I could. I even stopped buying meat because I could no longer afford it.<br />Bank of America seized my home and I had to leave Detroit. I cried, I plead. It was no use—they did everything they could to take my home. They even refused to show me the mortgage note proving that they owned my home <br />The foreclosure crisis is real. But Washington's not trying to fix it. Instead, they're talking about a deficit commission whose report would make it more expensive to own a home. Or have health insurance, drive, or send your kids to college.<br />I can't believe it. Since losing my home in Detroit, I've moved to Wayne, MI and bought into a co-op. But the commission is trying to end the tax deduction for buying a mortgage, which would make it much more expensive to buy a house, a condo, or into a co-op—even if you already bought it. <br />On top of that, they want to tax the $150 I pay per month for my health insurance. And they want to raise the retirement age and hike Medicare co-pays for people on fixed incomes.<br />We elected our leaders to try to solve the problems our country faces. And we've got plenty of problems: a jobs crisis, a middle class income crisis, a foreclosure crisis, a health insurance crisis, and more. <br />But instead of trying to solve the real crises working families are facing, the Deficit Commission is trying to add all sorts of middle class taxes while give a tax cut to Bank of America and its CEO. Do they really think that this year's record $16 trillion in corporate profits is too low?<br />The Deficit Commission is trying to solve the wrong problem the wrong way at the wrong time. It's time we tell them."}
{"Language": "ENG"}
{"Local_Broadcast_Time": "2010-12-03 10:32 America/New_York"}
{"StartTime": "20101203153200.900", "EndTime": "20101203153205.880", "PrimaryTag": "TR1", "Text": "we like that leaders so uh... try to stop by our car"}
{"StartTime": "20101203153205.880", "EndTime": "20101203153206.710", "PrimaryTag": "TR1", "Text": "problems"}
{"StartTime": "20101203153206.710", "EndTime": "20101203153208.549", "PrimaryTag": "TR1", "Text": "that this country faces"}
{"StartTime": "20101203153208.549", "EndTime": "20101203153213.739", "PrimaryTag": "TR1", "Text": "and we believe in up and believe me we have plenty of problems adapt crisis of"}
{"StartTime": "20101203153213.739", "EndTime": "20101203153218.109", "PrimaryTag": "TR1", "Text": "middle-class crisis the poor close a crisis of health insurance crisis and"}
{"StartTime": "20101203153218.109", "EndTime": "20101203153219.730", "PrimaryTag": "TR1", "Text": "more"}
{"StartTime": "20101203153219.730", "EndTime": "20101203153223.109", "PrimaryTag": "TR1", "Text": "but instead of trying to stop the real crisis"}
{"StartTime": "20101203153223.109", "EndTime": "20101203153224.550", "PrimaryTag": "TR1", "Text": "family spaced"}
{"StartTime": "20101203153224.550", "EndTime": "20101203153229.420", "PrimaryTag": "TR1", "Text": "that deficit commission is trying to add all sorts of middle-class texas while"}
{"StartTime": "20101203153229.420", "EndTime": "20101203153234.580", "PrimaryTag": "TR1", "Text": "giving a tax cut to bank of america and its c_e_o_ lhs"}
{"StartTime": "20101203153234.580", "EndTime": "20101203153236.190", "PrimaryTag": "TR1", "Text": "speed really thing"}
{"StartTime": "20101203153236.190", "EndTime": "20101203153238.200", "PrimaryTag": "TR1", "Text": "that this year's record"}
{"StartTime": "20101203153238.200", "EndTime": "20101203153242.250", "PrimaryTag": "TR1", "Text": "sixteen trillion anne cooper profits is too low"}
{"StartTime": "20101203153242.250", "EndTime": "20101203153246.530", "PrimaryTag": "TR1", "Text": "the deficit commission is trying to stop the wrong problem the wrong way and this"}
{"StartTime": "20101203153246.530", "EndTime": "20101203153248.510", "PrimaryTag": "TR1", "Text": "time"}
{"StartTime": "20101203153248.510", "EndTime": "20101203153249.240", "PrimaryTag": "TR1", "Text": "less to kill them"}
{"End": "20101203153249", "FileName": "2010-12-03_1532_US_CampaignAds_Service_Employees_International_Union"}
